app/controllers/expenses_controller.rb

    def index
        @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

    def create
        @expense =  Expense.new(expense_params)

        respond_to do |format|
            if @expense.save
---
INSERT INTO "expenses" ("amount", "fixed", "payed_at", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 5.0], ["fixed", 1], ["payed_at", "2023-05-13"], ["name", "expense test"], ["created_at", "2023-05-13 03:29:11.020818"], ["updated_at", "2023-05-13 03:29:11.020818"]]